[
  {
    "title": "The Witcher 3",
    "description": "The Witcher 3: Wild Hunt is a 2015 action role-playing video game developed and published by CD Projekt. Based on The Witcher series of fantasy novels by Polish author Andrzej Sapkowski, it is the sequel to the 2011 game The Witcher 2: Assassins of Kings and the third main installment in The Witcher video game series, played in an open world with a third-person perspective.",
    "image": "../assets/the-witcher.png",
    "price": 60,
    "onSale": true,
    "discount": 0.75,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "May 19, 2015"
  },
  {
    "title": "Dying Light 2",
    "description": "Dying Light 2 is an upcoming action role-playing video game developed by Techland and published by Warner Bros. Interactive Entertainment. It is the sequel to the 2015 game Dying Light and is scheduled to be released for Microsoft Windows, PlayStation 4, and Xbox One in 2021.",
    "image": "../assets/dl2.png",
    "price": 60,
    "onSale": true,
    "discount": 0.66,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "2021"
  },
  {
    "title": "Cyberpunk 2077",
    "description": "Cyberpunk 2077 is an upcoming action role-playing video game developed and published by CD Projekt. Based on the Cyberpunk tabletop role-playing game, it is scheduled to be released for Microsoft Windows, PlayStation 4, and Xbox One on 16 April 2020.",
    "image": "../assets/cyberpunk.jpg",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "April 16, 2020"
  },
  {
    "title": "The Last of Us Part II",
    "description": "The Last of Us Part II is an upcoming action-adventure game developed by Naughty Dog and published by Sony Interactive Entertainment. It is scheduled to be released for the PlayStation 4 on May 29, 2020.",
    "image": "../assets/last_of_us_II.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "Playstation 4"
    ],
    "releaseDate": "May 29, 2020"
  },
  {
    "title": "Ghost of Tsushima",
    "description": "Ghost of Tsushima is an upcoming action-adventure game developed by Sucker Punch Productions and published by Sony Interactive Entertainment for the PlayStation 4. It is scheduled to be released on July 17, 2020.",
    "image": "../assets/ghost_of_tsushima.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "Playstation 4"
    ],
    "releaseDate": "July 17, 2020"
  },
  {
    "title": "Death Stranding",
    "description": "Death Stranding is an upcoming action game developed by Kojima Productions and published by Sony Interactive Entertainment for the PlayStation 4. It is scheduled to be released on November 8, 2019.",
    "image": "../assets/deathStrading.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "Playstation 4"
    ],
    "releaseDate": "November 8, 2019"
  },
  {
    "title": "Final Fantasy VII Remake",
    "description": "Final Fantasy VII Remake is an upcoming action role-playing game developed and published by Square Enix. It is a remake of the 1997 PlayStation game Final Fantasy VII, and the first in a planned series of games remaking the original Final Fantasy VII. It is scheduled to be released for the PlayStation 4 on April 10, 2020.",
    "image": "../assets/ff.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "Playstation 4"
    ],
    "releaseDate": "April 10, 2020"
  },
  {
    "title": "Marvel's Avengers",
    "description": "Marvel's Avengers is an upcoming action-adventure game developed by Crystal Dynamics and published by Square Enix. It is scheduled to be released for Microsoft Windows, PlayStation 4, and Xbox One on May 15, 2020.",
    "image": "../assets/marvel.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "May 15, 2020"
  },
  {
    "title": "Watch Dogs Legion",
    "description": "Watch Dogs Legion is an upcoming action-adventure game developed by Ubisoft Toronto and published by Ubisoft. It is scheduled to be released for Microsoft Windows, PlayStation 4, Stadia, and Xbox One on March 6, 2020.",
    "image": "../assets/watchdogs.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "March 6, 2020"
  },
  {
    "title": "Grand Theft Auto V",
    "description": "Grand Theft Auto V is an action-adventure game developed by Rockstar North and published by Rockstar Games. It was released on 17 September 2013 for PlayStation 3 and Xbox 360, on 18 November 2014 for PlayStation 4 and Xbox One, and on 14 April 2015 for Microsoft Windows. It is the first main entry in the Grand Theft Auto series since 2008's Grand Theft Auto IV. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three criminals and their efforts to commit heists while under pressure from a government agency. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles. The game is played from either a third-person or first-person perspective and its world is navigated on foot or by vehicle.",
    "image": "../assets/gtaV.jpg",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "September 17, 2013"
  },
  {
    "title": "Elden Ring",
    "description": "Elden Ring is an upcoming action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment. It is scheduled to be released for Microsoft Windows, PlayStation 4, and Xbox One in 2020.",
    "image": "../assets/elden-ring.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "2020"
  },
  {
    "title": "Call of Duty: MW 2",
    "description": "Call of Duty: Modern Warfare 2 is a first-person shooter video game developed by Infinity Ward and published by Activision. It is the sixth installment in the Call of Duty series and the direct sequel to 2009's Call of Duty: Modern Warfare, continuing the same storyline. The game was released worldwide on November 10, 2009 for Microsoft Windows, the PlayStation 3, and Xbox 360. A separate version for the Wii was developed by Treyarch and released on November 11, 2009. The game's campaign follows a task force of U.S. and British special forces as they hunt Vladimir Makarov, a renegade Russian general who plans to use nuclear weapons to upset the balance of global power. The game's multiplayer mode features new additions to the series, including killstreaks, a new pointstreak system, and a new create-a-class system. The game's cooperative mode, Special Ops, features four new missions, including two that are playable with up to three other players. The game received critical acclaim, with praise directed towards its campaign, multiplayer, and graphics. It is considered by many to be one of the greatest video games of all time, and is the best-selling first-person shooter of all time, selling over 25 million copies worldwide by 2015.",
    "image": "../assets/cod.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "November 10, 2009"
  },
  {
    "title": "Half-Life: Alyx",
    "description": "Half-Life: Alyx is a virtual reality first-person shooter video game developed and published by Valve. It is the first Half-Life game since Half-Life 2: Episode Two in 2007, and the first game in the series to be released for 13 years. The game was released on March 23, 2020, for Microsoft Windows, and on March 3, 2020, for Valve Index, HTC Vive, and Oculus Rift headsets. The game is set between the events of Half-Life and Half-Life 2, and follows Alyx Vance, who is forced to work with the resistance to fight the alien Combine. The game is played from a first-person perspective, and features combat, exploration, and puzzle-solving elements. The game's story is told through non-linear levels, and the player can use a variety of weapons and gadgets. The game was met with critical acclaim, with praise directed towards its story, gameplay, and graphics. It was also a commercial success, selling over 1 million copies in its first week.",
    "image": "../assets/alyx.png",
    "price": 40,
    "onSale": false,
    "discount": 0,
    "rating": 3.3,
    "platforms": [
      "PC"
    ],
    "releaseDate": "March 23, 2020"
  },
  {
    "title": "Halo Infinite",
    "description": "Halo Infinite is an upcoming first-person shooter video game developed by 343 Industries and published by Xbox Game Studios for Xbox One, Xbox Series X, and Microsoft Windows. It is scheduled to be released in 2020.",
    "image": "../assets/halo.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.7,
    "platforms": [
      "PC",
      "Xbox One",
      "Xbox Series X"
    ],
    "releaseDate": "April 8, 2020"
  },
  {
    "title": "Resident Evil 3",
    "description": "Resident Evil 3 is an upcoming survival horror game developed and published by Capcom. It is scheduled to be released for Microsoft Windows, PlayStation 4, and Xbox One on April 3, 2020. It is a remake of the 1999 game of the same name, and is the third installment in the Resident Evil remake project, following Resident Evil 2. The game follows Jill Valentine and Carlos Oliveira as they attempt to escape from Raccoon City during a zombie apocalypse. The game is played from a third-person perspective, and features exploration, puzzle-solving, and combat elements. The game's story is told through non-linear levels, and the player can use a variety of weapons and items. The game was met with critical acclaim, with praise directed towards its gameplay, graphics, and story. It was also a commercial success, selling over 2 million copies worldwide by 2019.",
    "image": "../assets/re3.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "April 3, 2020"
  },
  {
    "title": "Red Dead Redemption 2",
    "description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. It is the third entry in the Red Dead series and a prequel to 2010's Red Dead Redemption. The game is played from a third-person perspective and its world is navigated on foot or by horseback. The story is set in 1899 in a fictionalized representation of the Western, Midwestern, and Southern United States and follows outlaw Arthur Morgan, a member of the Van der Linde gang. The game's open world design lets players freely roam in an open world environment, which includes cities, prairies, forests, and mountains. The game features elements of a nonlinear narrative, and players control Arthur and his gang during robberies and other criminal activities. The game's story is told through cutscenes and gameplay sequences, and players can interact with non-player characters to influence the game's story. The game's combat system is based on gunplay, melee combat, and stealth mechanics. Players can use weapons such as revolvers, rifles, and shotguns, and can dual-wield weapons. The game's soundtrack features a score composed by Woody Jackson and a soundtrack featuring over 100 songs from the 1890s to 1910s.",
    "image": "../assets/rdr2.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "October 26, 2018"
  },
  {
    "title": "Borderlands 3",
    "description": "Borderlands 3 is an upcoming action role-playing first-person shooter video game developed by Gearbox Software and published by 2K Games. It is the sequel to 2012's Borderlands 2, and the fourth main entry in the Borderlands series. The game is scheduled to be released for Microsoft Windows, PlayStation 4, and Xbox One on September 13, 2019. The game is set on the fictional planet of Pandora, where players assume the roles of four new Vault Hunters as they attempt to stop the Calypso Twins from opening the Vault on Promethea. The game is played from a first-person perspective, and features elements of role-playing games such as character customization and loot. The game's story is told through non-linear levels, and the player can use a variety of weapons and items. The game was met with critical acclaim, with praise directed towards its gameplay, graphics, and story. It was also a commercial success, selling over 5 million copies worldwide by 2019.",
    "image": "../assets/borderlands.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 4.5,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "September 13, 2019"
  },
  {
    "title": "Harry Potter",
    "description": "Harry Potter: Wizards Unite is a location-based augmented reality game developed by Niantic and published by Warner Bros. Interactive Entertainment. It is based on the Harry Potter franchise and is the second game in the Wizarding World franchise, following Pokémon Go. The game was released on June 21, 2019, for iOS and Android devices. The game is set in the Harry Potter universe, and players take on the role of a new recruit of the Statute of Secrecy Task Force, a secret organization that protects the wizarding world from Muggle knowledge of magic. The game is played from a first-person perspective, and features elements of role-playing games such as character customization and loot. The game's story is told through non-linear levels, and the player can use a variety of spells and items. The game was met with critical acclaim, with praise directed towards its gameplay, graphics, and story. It was also a commercial success, selling over 5 million copies worldwide by 2019.",
    "image": "../assets/harryPotter.png",
    "price": 30,
    "onSale": false,
    "discount": 0,
    "rating": 3,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "June 21, 2019"
  },
  {
    "title": "Demon Souls",
    "description": "Demon's Souls is an action role-playing game developed by FromSoftware and published by Sony Computer Entertainment for the PlayStation 3. It was released in Japan in October 2009, North America in January 2010, and Europe in March 2010. The game is a spiritual successor to FromSoftware's 1994 PlayStation game King's Field, and is the first installment in the Souls series. The game is set in the fictional kingdom of Boletaria, where players assume the role of a cursed knight who must travel to the Tower of Latria to defeat the Old One. The game is played from a third-person perspective, and features elements of role-playing games such as character customization and loot. The game's story is told through non-linear levels, and the player can use a variety of weapons and items. The game was met with critical acclaim, with praise directed towards its gameplay, graphics, and story. It was also a commercial success, selling over 2 million copies worldwide by 2019.",
    "image": "../assets/demonSouls.png",
    "price": 60,
    "onSale": true,
    "discount": 0.2,
    "rating": 5,
    "platforms": [
      "Playstation 5"
    ],
    "releaseDate": "November 12, 2020"
  },
  {
    "title": "God of War",
    "description": "God of War is an action-adventure game developed by Santa Monica Studio and published by Sony Interactive Entertainment. It is the eighth installment in the God of War series, the eighth chronologically, and the sequel to 2010's God of War III. The game is set in ancient Greece with vengeance as its central motif. Players control Kratos, a Spartan warrior who serves the Greek gods, as he wields the Blades of Chaos against the Olympian Gods. The game is played from a third-person perspective and its world is navigated on foot or by using vehicles such as horses and zeppelins. The story is told through cinematics and gameplay sequences, and players can interact with non-player characters to influence the game's story. The game's combat system is based on combo-based combat, and players can use weapons such as swords, spears, and shields. The game's soundtrack features a score composed by Bear McCreary and a soundtrack featuring over 100 songs from the 1890s to 1910s.",
    "image": "../assets/godOfWar.png",
    "price": 60,
    "onSale": true,
    "discount": 0.5,
    "rating": 4.8,
    "platforms": [
      "Playstation 4",
      "PC"
    ],
    "releaseDate": "April 20, 2018"
  },
  {
    "title": "Tomb Raider",
    "description": "Shadow of the Tomb Raider is an action-adventure game developed by Eidos Montréal and published by Square Enix. It is the twelfth main entry in the Tomb Raider series and the sequel to 2015's Rise of the Tomb Raider. The game is set in the fictional South American country of Paititi, where players control Lara Croft as she attempts to stop a Mayan apocalypse. The game is played from a third-person perspective and its world is navigated on foot or by using vehicles such as horses and zeppelins. The story is told through cinematics and gameplay sequences, and players can interact with non-player characters to influence the game's story. The game's combat system is based on combo-based combat, and players can use weapons such as swords, spears, and shields. The game's soundtrack features a score composed by Brian D'Oliveira and a soundtrack featuring over 100 songs from the 1890s to 1910s.",
    "image": "../assets/shadowOfTheTombRaider.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 3.9,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "September 14, 2018"
  },
  {
    "title": "Gears of War 5",
    "description": "Gears of War 5 is an upcoming third-person shooter video game developed by The Coalition and published by Xbox Game Studios for Microsoft Windows and Xbox One. It is the fifth mainline entry in the Gears of War series and the sequel to Gears of War 4. The game is set in the fictional world of Sera, where players control Kait Diaz, a member of the Locust-hunting group known as the COG. The game is played from a third-person perspective and its world is navigated on foot or by using vehicles such as horses and zeppelins. The story is told through cinematics and gameplay sequences, and players can interact with non-player characters to influence the game's story. The game's combat system is based on combo-based combat, and players can use weapons such as swords, spears, and shields. The game's soundtrack features a score composed by Brian D'Oliveira and a soundtrack featuring over 100 songs from the 1890s to 1910s.",
    "image": "../assets/gearsOfWar5.png",
    "price": 60,
    "onSale": false,
    "discount": 0,
    "rating": 3.2,
    "platforms": [
      "PC",
      "Xbox One"
    ],
    "releaseDate": "September 10, 2019"
  },
  {
    "title": "Skyrim",
    "description": "The Elder Scrolls V: Skyrim is an action role-playing game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the fifth main installment in The Elder Scrolls series, following The Elder Scrolls IV: Oblivion, and was released worldwide for Microsoft Windows, PlayStation 3, and Xbox 360 on November 11, 2011. Skyrim's main story revolves around the player character and their quest to defeat Alduin the World-Eater, a dragon who is prophesied to destroy the world. Over the course of the game, the player completes quests and develops the character by improving skills. The game is noted for its open world design; players may travel anywhere in the game world at any time, and may freely ignore or postpone the main storyline indefinitely. The game continues the open-world tradition of its predecessors by allowing the player to travel anywhere in the game world at any time, and to ignore or postpone the main storyline indefinitely. The game continues the open-world tradition of its predecessors by allowing the player to travel anywhere in the game world at any time, and to ignore or postpone the main storyline indefinitely.",
    "image": "../assets/skyrim.png",
    "price": 30,
    "onSale": false,
    "discount": 0,
    "rating": 4.7,
    "platforms": [
      "PC",
      "Xbox One",
      "Playstation 4"
    ],
    "releaseDate": "November 11, 2011"
  }
]